
TOKEN = ''


QIWI_PAB_KEY =''


STR1 = '''Я загадываю вам комбинацию из цифр от 0 до 9. Ваша задача отгадать данную комбинацию. 
- цифры не могут повторяться!!!
- за каждую угаданную цифру вы получаете корову 🐄.
- если вы угадали цифру и она стоит на своем месте то вы получаете быка 🐃 !
- на начальном уровне загаданная комбинация состоит из 5-ти цифр, на следующем из 6-ти  и т.д.
- задача угадать за наименьшее количество ходов и время.


Желаем Вам Удачи !


/new_game - Новая игра.

/champs - Чемпионы

/about - о программе'''
              
ABOUT = ''' 👋 Здравствуйте! Я очень рад, что вы играете в данную логическую игру. Если у вас есть пожелания или критические замечания, возможно вы хотите заказать себе изготовление бота любой сложности, по всем вопросам напишите автору программы.
Также вы можете оставить донат.            
'''

MUADD = f'''🎮  /new_game - новая игра

🏆  /champs - таблица чемпионов

🙂  /my_game - мои лучшие игры

❓  /help - помощь

🔍  /about - о программе '''

ABORT = f'''Возможно вы выбрали слишком сложный уровень...

{MUADD}'''



CHANCHLEV = f'''Выберите уровень, где 1 самый легкий, а 3 - сложный. Не переоценивайте свои силы, начните с легкого.

1️⃣  - Новичок (не путать с боевым отраляющим веществом) - последовательность из 5 цифр от 0 до 9

2️⃣  - Продвинутый  - последовательность из 6 цифр от 0 до 9

3️⃣  - Мастер - последовательность из 7 цифр от 0 до 9

'''